# ── Shell & Terminal ─────────────────────────────────────────────────
brew "bash"
brew "coreutils"
brew "fzf"
brew "fd"      # modern find — backs FZF_DEFAULT_COMMAND, respects .gitignore
brew "direnv"
brew "bat"
brew "bat-extras"
brew "zoxide"  # smart cd (frecency-ranked): `z <partial>` jumps to best match
brew "atuin"         # sqlite shell history with fuzzy Ctrl+R + optional cross-machine sync
brew "atuin-server"  # self-hosted sync server for atuin (separate formula from the client)
brew "tmux"

# ── Editors & AI Coding ──────────────────────────────────────────────
brew "neovim"
brew "ollama"
brew "gemini-cli"
brew "opencode"
cask "claude-code@latest"
cask "codex"

# ── AI Agent Sandbox ─────────────────────────────────────────────────
brew "nono"

# ── Search & File Tools ──────────────────────────────────────────────
brew "ripgrep"
brew "ripgrep-all"
brew "wget"
brew "curl"
brew "xz"
brew "make"
brew "pup"
brew "fswatch"

# ── Git ──────────────────────────────────────────────────────────────
brew "gh"
brew "git-delta"
brew "git-absorb"
brew "git-machete"

# ── Kubernetes & Cloud ───────────────────────────────────────────────
brew "kind"
brew "k9s"
brew "lima"
brew "skaffold"
brew "stern"
brew "tfenv"
brew "crane"
brew "grpcurl"
brew "azure-cli"
brew "awscli"
cask "gcloud-cli"

# ── Languages & Runtimes ─────────────────────────────────────────────
brew "go"
brew "gcc"
brew "uv"
brew "nvm"

# ── Linting & Code Quality ───────────────────────────────────────────
brew "shellcheck"
brew "hadolint"
brew "cue"

# ── API & Network ────────────────────────────────────────────────────
brew "httpie"
brew "w3m"

# ── Docs & Productivity ──────────────────────────────────────────────
brew "jq"
brew "tldr"
brew "hugo"
brew "adr-tools"
brew "acli"
brew "gnupg"
brew "minutes"

# ── Apps ─────────────────────────────────────────────────────────────
cask "xbar"
cask "jordanbaird-ice"  # menu bar manager: hide/reorder items, tames xbar + Control Center surface
cask "obsidian"
cask "meetingbar"
cask "ghostty"
cask "1password-cli"
